Revit 2027 API
AlignmentStationLabelSetOptions.StartStation Property
 The starting station for creating labels in the set, in Revit internal model units (standard Imperial feet). The default value is null. When null, the station value corresponding to the alignment's DisplayedStartStation is used.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double? StartStation { get; set; }
Public Property StartStation As Double?
	Get
	Set
public:
property Nullable<double> StartStation {
	Nullable<double> get ();
	void set (Nullable<double> value);
}
member StartStation : Nullable<float> with get, set
Property Value
Nullable<Double>
See Also
Reference
AlignmentStationLabelSetOptions Class
Autodesk.Revit.DB.Infrastructure Namespace